let println = console.log;
/*
일단 이런 상황이 되어 버리면, 키 입력 및 코딩이 쉽고 습관이 된다.

만족스럽다.
Home 과 End 키가 좀 안잡히는 것 같은데, 웹 서핑을 통해 해결이 가능할 것.
익숙해지는 것이 필요하다. 키 매핑도 변경이 가능하면 바꿔야 한다. 해피해킹 비슷한 ?
타이핑이 스타일이 살아나니 훨씬 쉽네. 의자 양옆의 팔걸이는 떼어버리든가 해야지 원.

영혼이 필요한 키보드 모드.
LED 를 이용한 좀 더 비주얼한 키보딩이 된다. 사실 별로 중요하진 않음.
저가형 치고는 꽤 괜찮은 수준의 타이핑.
그러나 역시나 저가형이다. 2만원 정도를 더 내고, 네제시스 텐키리스를 사는 것이 더 나을 듯.
알루미늄 상판은 좀 더 사용해봐야 한다.
스페이스바가 좀 심하게 덜컹대는데, 의도한 것인지... 소음이 좀 심한데 ?

타이핑은 확실히 맛이 나네.
이제 코딩을 하자.
문서도 쓰고, 글도 쓴다.
방해가 되지 않는 선에서, 항상 머리 속의 생각을 정리하고, 끝까지 생각해낸다.
앞으로는 한가지를 붙잡고, 뭐든지 끝까지 해내는 것이다.

박경리, 박완서.
글을 쓰는 사람들.
작지만 의미있는 행동들.
모든 행동에는 나에게 이유가 있어야 한다.
지금이 가장 위험한데, 아무런 개인적 이유가 없이 회사에 다니고 있음.
주별로 목표를 정한다.

이번 주는 베이직 구성의 사이트를 반드시 작성함.
목표에 따른 진전도가 있어야 함.
회사 설립.
사이트 작성.
하루 한가지씩의 목표를 정하고, 이를 꾸준히 행함.
하루가 모여 월이 되고, 월이 모여 연이된다.
하루의 수입은 월의 수입이 되고, 월의 수입은 연의 수입이된다.
해피해킹. 좋은 키보드.

하룻밤에 읽는 서양 사상.

데카르트. 경의로운 철학과 수학의 천재.

철학, 수학은 모두 세상과 문제를 바라보는 다양한 사고방식을 가져야 한다는 점에서 매우 좋은 학문이다.
자신만의 철학과 수학 모두 가지고 있어야 한다.
철학이 없으면 내 시선을 가지고 세상을 살아갈 수 없다.
수학이 없으면 세상을 있는 그대로 받아들이고 해석하지 못한다.
수학은 세상을 보는 눈이자, 창문이다.
철학은 세상을 담아낼 수 있는 그릇이다.
열렬히 공부하고, 사고해라.
끝까지 치열하게 사고하지 않기 때문에, 스스로의 철학과 수학이 없는 것이다.

중심을 잡고, 세상을 충분히 재미있게 살아가라.
당장 내일 죽을 수 있다. 언제든지.

세상은 내가 없어도 얼마든지, 아무런 일 없다는 듯이 돌아간다.
거부할 수 없는 진실인데 나만 억울해하는 것일테지.

세상의 아픈 일들을 하나씩 겪어보면 세상이 다르게 보인다. 착각 속에 살아왔던 세상이 깨우쳐지는 것이다.
경험은 정말로 중요하다. 좋은 경험만 한다는 것은 어차피 불가능하다.
나쁜 경험이나 실패, 부끄러움들도 나중에 뒤돌아보면 그게 정말 안좋은 경험만은 아니었던 것 같다.
나 자신이 누구이고, 어떤 사람인지는 뭔가를 경험하면서 하나씩 알아가게 된다. 그리고, 과거의 나로 인해 미래의 나는 어떤 태도를 가지는 것이 좋을지 결정을 할 수 있다.
경험이라는 것은 그럴 것이다 라거나 그래야만 할 것 같은 나의 모습들이 결국 착각이라는 사실을 하나씩 깨닫게 해준다.
나를 더 자세하게 들여다 볼 수 있는 것이 경험과 그에 대한 나의 태도, 반응들.

경험과 그에 대한 얕지 않은 사색이 미래의 나를 하나씩 만들어 간다고 보면, 경험은 가장 좋은 선생이다. 책, 영화, 대화, 여행과 같은 외부에서 발견하는 나와는 다른 시각과 사고는 내 생각의 다양함과 깊이를 더해 준다.
가장 좋은 선생은 인생을 살면서 경험하는 모든 것들이다.
그게 지루하고 새로운 것이 없는 반복들 뿐이라면, 자연스럽게 배움은 많을 수 없다.

여러가지를 해보자.
인생을 가볍게 살자.
친구들을 만들고, 세상을 받아들여보자.
나쁜 일만 있지는 않을 것이다.
나를 사랑하고 아껴야, 남들도 내 존재를 인정하게 되니, 끝까지 나를 사랑해야 한다.

끝까지 해본다.
IT 쪽도 갈 수 있는 곳까지 가보고,
삶이 끝나는 마지막 순간까지 나에 대한 사랑을 놓지 않는다.

때리고 싶은 사람은 때리고, 사랑하고 싶은 사람은 사랑하자.

어차피 죽을 것, 재미있게 살다가 죽자니까 ?









*/
